In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}
arr

array([10, 20, 30])

In [3]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [4]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [8]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [9]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2=pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])

In [11]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [12]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [13]:
from numpy.random import randn

In [14]:
np.random.seed(101)

In [15]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [16]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [18]:
type(df['X'])

pandas.core.series.Series

In [19]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [20]:
df.Y

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [21]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [22]:
df.loc[['A','B'],['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [23]:
df['total_sum']=df['W']+df['X']+df['Y']+df['Z']

In [24]:
df

          W         X         Y         Z  total_sum
A  2.706850  0.628133  0.907969  0.503826   4.746778
B  0.651118 -0.319318 -0.848077  0.605965   0.089688
C -2.018168  0.740122  0.528813 -0.589001  -1.338233
D  0.188695 -0.758872 -0.933237  0.955057  -0.548357
E  0.190794  1.978757  2.605967  0.683509   5.459028

In [25]:
df['total_sum']

A    4.746778
B    0.089688
C   -1.338233
D   -0.548357
E    5.459028
Name: total_sum, dtype: float64

In [26]:
df[['Z','total_sum']]

          Z  total_sum
A  0.503826   4.746778
B  0.605965   0.089688
C -0.589001  -1.338233
D  0.955057  -0.548357
E  0.683509   5.459028

In [27]:
df.loc['D']

W            0.188695
X           -0.758872
Y           -0.933237
Z            0.955057
total_sum   -0.548357
Name: D, dtype: float64

In [28]:
df.iloc[3]

W            0.188695
X           -0.758872
Y           -0.933237
Z            0.955057
total_sum   -0.548357
Name: D, dtype: float64

In [29]:
df1=df.drop('total_sum',inplace=True,axis=1)

In [30]:
df1

In [31]:
df1

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df.shape

(5, 4)

In [34]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [35]:
df[['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [38]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[df>0].dropna()

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df[df['X']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df[df['Y']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df[df['Z']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [46]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [48]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [49]:
boolser = df['W']>0
result=df[boolser]
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [50]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df[(df['W']>0)|(df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [54]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [56]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
newind =' CA NY WY OR CO'.split()

In [58]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [59]:
df['new']=newind

In [60]:
df

          W         X         Y         Z new
A  2.706850  0.628133  0.907969  0.503826  CA
B  0.651118 -0.319318 -0.848077  0.605965  NY
C -2.018168  0.740122  0.528813 -0.589001  WY
D  0.188695 -0.758872 -0.933237  0.955057  OR
E  0.190794  1.978757  2.605967  0.683509  CO

In [61]:
df.set_index('new')

            W         X         Y         Z
new
CA   2.706850  0.628133  0.907969  0.503826
NY   0.651118 -0.319318 -0.848077  0.605965
WY  -2.018168  0.740122  0.528813 -0.589001
OR   0.188695 -0.758872 -0.933237  0.955057
CO   0.190794  1.978757  2.605967  0.683509

In [62]:
df['state']=newind

In [63]:
df

          W         X         Y         Z new state
A  2.706850  0.628133  0.907969  0.503826  CA    CA
B  0.651118 -0.319318 -0.848077  0.605965  NY    NY
C -2.018168  0.740122  0.528813 -0.589001  WY    WY
D  0.188695 -0.758872 -0.933237  0.955057  OR    OR
E  0.190794  1.978757  2.605967  0.683509  CO    CO

In [64]:
df.drop('new',axis=1,inplace=True)

In [65]:
df

          W         X         Y         Z state
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [68]:
df.drop('state',axis=1,inplace=True)

In [69]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df['state']=newind

In [71]:
df

          W         X         Y         Z state
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [73]:
df.set_index('state')

              W         X         Y         Z
state
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

In [75]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))

In [76]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [77]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [78]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [80]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [81]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [82]:
outside=['G3','G3','G3','G4','G4','G4']
inside=[3,3,3,4,4,4]
hier_index=list(zip(outside,inside))

In [85]:
hier_index

[('G3', 3), ('G3', 3), ('G3', 3), ('G4', 4), ('G4', 4), ('G4', 4)]

In [88]:
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [89]:
hier_index

MultiIndex([('G3', 3),
            ('G3', 3),
            ('G3', 3),
            ('G4', 4),
            ('G4', 4),
            ('G4', 4)],
           )

In [91]:
pd.DataFrame(randn(6,2),hier_index,['C','D'])

             C         D
G3 3 -1.005187 -0.741790
   3  0.187125 -0.732845
   3 -1.382920  1.482495
G4 4  0.961458 -2.141212
   4  0.992573  1.192241
   4 -1.046780  1.292765

In [92]:
pd.DataFrame(randn(6,2),hier_index,['A','B'])

             A         B
G3 3 -1.467514 -0.494095
   3 -0.162535  0.485809
   3  0.392489  0.221491
G4 4 -0.855196  1.541990
   4  0.666319 -0.538235
   4 -0.568581  1.407338

In [93]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [95]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [96]:
df.loc['G2'].loc[2]

A    0.807706
B    0.072960
Name: 2, dtype: float64

In [97]:
df.reset_index()

  level_0  level_1         A         B
0      G1        1  0.302665  1.693723
1      G1        2 -1.706086 -1.159119
2      G1        3 -0.134841  0.390528
3      G2        1  0.166905  0.184502
4      G2        2  0.807706  0.072960
5      G2        3  0.638787  0.329646

In [98]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [99]:
df.index.names = ['Group','Num']

In [100]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [101]:
df.loc['G1'].loc[1]['B']

1.693722925204035

In [102]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [103]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [104]:
df=pd.DataFrame(d)

In [105]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [107]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [108]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [111]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [112]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [110]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [117]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [118]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [119]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [120]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [126]:
df.dropna(thresh=2,inplace=True)

In [127]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [132]:
df.dropna(thresh=0,inplace=True)

In [133]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [134]:
data = {
    'Company':['GOOG','GOOG','GOOG','MSFT','MSFT','MSFT'],
    'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah']
,'Sales':[200,120,340,124,243,350]}

In [135]:
df=pd.DataFrame(data)

In [136]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    GOOG      Amy    340
3    MSFT  Vanessa    124
4    MSFT     Carl    243
5    MSFT    Sarah    350

In [139]:
byComp=df.groupby('Company')

In [140]:
byComp

In [142]:
byComp.mean()

         Sales
Company
GOOG       220
MSFT       239

In [144]:
byComp.std()

              Sales
Company
GOOG     111.355287
MSFT     113.053085

In [145]:
byComp.sum()

         Sales
Company
GOOG       660
MSFT       717

In [147]:
byComp.count()

         Person  Sales
Company
GOOG          3      3
MSFT          3      3

In [148]:
byComp.min()

        Person  Sales
Company
GOOG       Amy    120
MSFT      Carl    124

In [149]:
byComp.describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
GOOG      3.0  220.0  111.355287  120.0  160.0  200.0  270.0  340.0
MSFT      3.0  239.0  113.053085  124.0  183.5  243.0  296.5  350.0

In [150]:
byComp.describe().transpose()

Company            GOOG        MSFT
Sales count    3.000000    3.000000
      mean   220.000000  239.000000
      std    111.355287  113.053085
      min    120.000000  124.000000
      25%    160.000000  183.500000
      50%    200.000000  243.000000
      75%    270.000000  296.500000
      max    340.000000  350.000000

In [153]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3']
                  ,'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},index=[0,1,2,3])

In [155]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']},index=[4,5,6,7])

In [156]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11']
                 ,'B':['B8','B9','B10','B11'],
                 'C':['C8','C9','C10','C11'],
                 'D':['D8','D9','D10','D11']},index=[8,9,10,11])

In [157]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [158]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [159]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [160]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [162]:
df=pd.concat([df1,df2,df3],axis=1)

In [163]:
df

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [164]:
df.fillna(value='*')

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0   *   *   *   *    *    *    *    *
1   A1  B1  C1  D1   *   *   *   *    *    *    *    *
2   A2  B2  C2  D2   *   *   *   *    *    *    *    *
3   A3  B3  C3  D3   *   *   *   *    *    *    *    *
4    *   *   *   *  A4  B4  C4  D4    *    *    *    *
5    *   *   *   *  A5  B5  C5  D5    *    *    *    *
6    *   *   *   *  A6  B6  C6  D6    *    *    *    *
7    *   *   *   *  A7  B7  C7  D7    *    *    *    *
8    *   *   *   *   *   *   *   *   A8   B8   C8   D8
9    *   *   *   *   *   *   *   *   A9   B9   C9   D9
10   *   *   *   *   *   *   *   *  A10  B10  C10  D10
11   *   *   *   *   *   *   *   *  A11  B11  C11  D11

In [165]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                          'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [166]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [167]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [168]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [170]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [171]:
left=pd.DataFrame({'key1':['K0','K0','K1','K2'],
                   'key2':['K0','K1','K0','K1'],
    'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})

right=pd.DataFrame({'key1':['K0','K1','K1','K2'],
                    'key2':['K0','K0','K0','K0'],
                  'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']})

In [172]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [173]:
pd.merge(left,right)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [174]:
pd.merge(right,left)

  key1 key2   C   D   A   B
0   K0   K0  C0  D0  A0  B0
1   K1   K0  C1  D1  A2  B2
2   K1   K0  C2  D2  A2  B2

In [175]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [176]:
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [177]:
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [178]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2']
                    },index=['K0','K1','K2'])
right = pd.DataFrame({'C':['C0','C2','C3'],
                     'D':['D0','D1','D2']},index=['K0','K2','K3'])

In [179]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D1